TESTCASES/0.BASELINE/DATA/BoR_SST/SST_MediumBody/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         10; //20000; //10;

deltaT          1;

writeControl    timeStep;

writeInterval   1; //1000; //10;

purgeWrite      0;

writeFormat     ascii; //inary; // ascii;

writePrecision  10;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions 
{ 
    #includeFunc  probes 
    #includeFunc  flowRatePatch 
}

// ************************************************************************* //
